//Задача 8: Напишите программу, которая на вход принимает число (N),
//а на выходе показывает все чётные числа от 1 до N.

Console.Clear();
Console.WriteLine("Условие: Вводите только любые целые трехзначные числа");
int xa = 0, ya = 1;
Console.SetCursorPosition(xa, ya);
Console.WriteLine("-----------------------------------------------");

//int N = Convert.ToInt32(Console.ReadLine());
int N =0;
Console.Write($"Введите кол-во случайных чисел N = {N}");

